src/cf/Enums/КатегорииНачисленийИНеоплаченногоВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>КатегорииНачисленийИНеоплаченногоВремени</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПовременнаяОплатаТруда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РайонныйКоэффициент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СевернаяНадбавка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтпуска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускПоБеременностиИРодам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаБольничногоЛиста</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаБольничногоЛистаЗаСчетРаботодателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаБольничногоПрофзаболевание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаБольничногоНесчастныйСлучайНаПроизводстве</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаКомандировки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БолезньБезОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускБезОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаДолиРайонногоКоэффициентаВСреднемЗаработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаДолиСевернойНадбавкиВСреднемЗаработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпенсацияОтпуска</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/КатегорииНачисленийИНеоплаченногоВремени/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает массив категорий пособий, которые после вступления в прямые выплаты выплачиваются напрямую ФСС.
//
// Возвращаемое значение:
//   Массив
//
Функция КатегорииПрямыхВыплатФСС() Экспорт
	Массив = Новый Массив;
	Массив.Добавить(ОплатаБольничногоЛиста);
	Массив.Добавить(ОплатаБольничногоНесчастныйСлучайНаПроизводстве);
	Массив.Добавить(ОплатаБольничногоПрофзаболевание);
	Массив.Добавить(ОтпускПоБеременностиИРодам);
	Возврат Массив;
КонецФункции

// Возвраащает массив категорий начислений которые отвечают за оплату РК.
//
// Возвращаемое значение:
//    Массив - Значения типа ПеречислениеСсылка.КатегорииНачисленийИНеоплаченногоВремени.
//
Функция КатегорииРК() Экспорт
	Массив = Новый Массив;
	Массив.Добавить(РайонныйКоэффициент);
	Массив.Добавить(ОплатаДолиРайонногоКоэффициентаВСреднемЗаработке);
	Возврат Массив;
КонецФункции

// Возвраащает массив категорий начислений которые отвечают за оплату СН.
//
// Возвращаемое значение:
//    Массив - Значения типа ПеречислениеСсылка.КатегорииНачисленийИНеоплаченногоВремени.
//
Функция КатегорииСН() Экспорт
	Массив = Новый Массив;
	Массив.Добавить(СевернаяНадбавка);
	Массив.Добавить(ОплатаДолиСевернойНадбавкиВСреднемЗаработке);
	Возврат Массив;
КонецФункции

#КонецОбласти

#КонецЕсли
